88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp

/****************************************************************/
// ePaperAnchorAlarm by. M. Preidel
/****************************************************************/

#include <Arduino.h>
#include <math.h>

//**** ESP32 sleep and rtc memory (which survives deep sleep)
#include "esp_sleep.h"
#include "driver/rtc_io.h"

#include <SimpleTimer.h>        // Simple Timer, used instead of Blynk timer for virtuino
SimpleTimer gpsTimer;
int gpsTimerHandle=1;

// ** rotary encoder lib
#include <ESP32Encoder.h>
#define ENCODER_CLK_PIN 22 //25
#define ENCODER_DT_PIN 27
#define ENCODER_SW_PIN 26

// button stuff from ePaperBarograf
#define BUTTON1 GPIO_NUM_26
struct Button {
  const uint8_t PIN;
  uint32_t numberKeyPresses;
  bool pressed;
};
volatile Button button1 = {ENCODER_SW_PIN, 0, false};

void ARDUINO_ISR_ATTR button1Handler();

// include bounce2 library for button debouncing
#include <Bounce2.h>
Bounce button = Bounce();

// GPIO for measurement of voltage
#define VOLTAGE_PIN 39

// TinyGPSPlus library for GPS handling
#include <TinyGPSPlus.h>
// #include <SoftwareSerial.h>

// float volt, percent;                    // battery voltage and percent fill degree

static const int RXPin = 19, TXPin = 15; //22;
static const uint32_t GPSBaud = 9600;

TinyGPSPlus gps;  // The TinyGPSPlus object
HardwareSerial gpsSerial(1); // The serial connection to the GPS device

// for tests latitude and longitude of start position
double startLat = 0.0;
double startLon = 0.0;
double anchorDistance_m = 23;
double anchorBearing_deg = 45.0;
double anchorLat = 0.0;
double anchorLon = 0.0;

// ADC calibration stuff
// https://www.reddit.com/r/esp32/comments/1g4ma01/esp32_s3_adc/?rdt=46482
#include <esp_adc_cal.h>

#if CONFIG_IDF_TARGET_ESP32
#define ADC_EXAMPLE_CALI_SCHEME     ESP_ADC_CAL_VAL_EFUSE_VREF
#elif CONFIG_IDF_TARGET_ESP32S3
#define ADC_EXAMPLE_CALI_SCHEME     ESP_ADC_CAL_VAL_EFUSE_TP_FIT
#endif
#define VREF 1100  // Reeference voltag. used if no data in EFUSE

// *** lib for permanent data storage in EEPROM
// https://randomnerdtutorials.com/esp32-save-data-permanently-preferences/
// if these defines are set, preferences are written / saved to eeprom. 
// otherwise just from RTC storage (survives deep sleep)
#define WRITE_PREFERENCES
#define READ_PREFERENCES
#include <Preferences.h>
Preferences preferences; // object for preference storage in EEPROM
#define prefIDENT "AnchorAlarm1" // unique identifier for preferences

// header file mit #defines, forward declarations, "extern" declarations von woanders deklarierten globalen var's
// globale variablen und alle anderen #includes sind im .cpp file
#include "ePaperAnchorAlarm.h"
#include "epaperGPS.h" // GPS stuff function declarations
#include "global.h"    // global stuff from other modules

//float volt, percent;                    // battery voltage and percent fill degree

char outstring[maxLOG_STRING_LEN];      // for serial and other debug output

//----------------------- measurement data variables -----------------------
uint32_t startTimeMillis; 

ESP32Encoder encoder;  // rotary encoder object

// measurement data, stored in RTC memory which survives the deep sleep. ESP32 has 8 K, used for this 5448 Bytes
RTC_DATA_ATTR measurementData wData;

// screen colors
RTC_DATA_ATTR uint32_t fgndColor;
RTC_DATA_ATTR uint32_t bgndColor;

// determine after how many partial updates a full update of the epaper is to be done
// 1: always full update
#ifdef LOLIN32_LITE
  #define FULL_UPDATE_INTERVAL  10
#endif

// GPIO definition for battery voltage reading
#define VOLTAGE_PIN 39

// GPIO definition for buzzer
#define BUZZER_PIN 2

// test control variables
bool testWelcomeMessage = false;
bool testRotaryEncoder = false;
bool testGPSModule = false;
bool testBuzzer = true;
bool testDisplayModule = false;
bool testBatteryVoltageReading = true;


/**************************************************!
   @brief    logOut()
   @details  Function create log output
   @return   void
***************************************************/
void logOut(int logLevel, char* str)
{
  char safeStr[maxLOG_STRING_LEN+10];
  static uint32_t logCnt = 0;
  // for safety: ensure zero termination well before the end of the string
  // crashes with static strings.
  // str[maxLOG_STRING_LEN-1]=0;
  if(logLevel <= logLEVEL){
    strncat(safeStr, str, maxLOG_STRING_LEN-1); // copy limited number of characters only
    sprintf(safeStr,"%ld %s",logCnt,str);
    //Serial.println(str);
    Serial.println(safeStr);
    logCnt++;
  }
}


/**************************************************!
   @brief    getChargeLevelFromVolts
   @details  Function convert voltage to battery charge level
   @details  see https://github.com/pangodream/18650CL/blob/master/src/Pangodream_18650_CL.cpp
   @param    volts : battery voltage in volts
   @return   int   : battery fill percentage as integer, 0..100
***************************************************/

int getChargeLevelFromVolts(double volts){
  //Array with voltage - charge definitions
  double _vs[] ={3.200,                                                     // 0
    3.250, 3.300, 3.350, 3.400, 3.450, 3.500, 3.550, 3.600, 3.650, 3.700,   // 1-10
    3.703, 3.706, 3.710, 3.713, 3.716, 3.719, 3.723, 3.726, 3.729, 3.732,   // 11-20
    3.735, 3.739, 3.742, 3.745, 3.748, 3.752, 3.755, 3.758, 3.761, 3.765,   // 21-30
    3.768, 3.771, 3.774, 3.777, 3.781, 3.784, 3.787, 3.790, 3.794, 3.797,   // 31-40
    3.800, 3.805, 3.811, 3.816, 3.821, 3.826, 3.832, 3.837, 3.842, 3.847,   // 41-50
    3.853, 3.858, 3.863, 3.868, 3.874, 3.879, 3.884, 3.889, 3.895, 3.900,   // 51-60
    3.906, 3.911, 3.917, 3.922, 3.928, 3.933, 3.939, 3.944, 3.950, 3.956,   // 61-70
    3.961, 3.967, 3.972, 3.978, 3.983, 3.989, 3.994, 4.000, 4.008, 4.015,   // 71-80
    4.023, 4.031, 4.038, 4.046, 4.054, 4.062, 4.069, 4.077, 4.085, 4.092,   // 81-90
    4.100, 4.111, 4.122, 4.133, 4.144, 4.156, 4.167, 4.178, 4.189, 4.200};  // 91-100

 int idx = 50;
 int prev = 0;
 int half = 0;
 if (volts >= 4.2){
   sprintf(outstring,"getChargeLevelFromVolts converted %f [V] to %d [%%]", volts, 100);
   logOut(2, outstring);
   return 100;
 }
 if (volts <= 3.2){
    sprintf(outstring,"getChargeLevelFromVolts converted %f [V] to %d [%%]", volts, 0);
    logOut(2, outstring);
   return 0;
 }
 while(true){
   half = abs(idx - prev) / 2;
   prev = idx;
   if(volts >= _vs[idx]){
     idx = idx + half;
   }else{
     idx = idx - half;
   }
   if (prev == idx){
     break;
   }
  }
  sprintf(outstring,"getChargeLevelFromVolts converted %f [V[] to %d [%%]", volts, idx);
  logOut(2, outstring);
  return idx;
}

/**************************************************!
   @brief    readBatteryVoltage
   @details  Function read battery voltage and percentage
   @details  Uses 3 methods to measure and calculated values
   @param    float* volts : battery voltage in volts
   @param    float* percent : battery filling status in percent of full
   @return   boolean true if calculation successful
***************************************************/

boolean readBatteryVoltage(float* percent, float* volt)
{
  uint32_t raw, millivolts1, millivolts2;

  float voltArduino, voltESP, voltDirect;
  float percentFit1, percentFit2, percent_direct, percentTable;

