88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
  esp_adc_cal_characteristics_t adc_chars;

  *percent = 100;
  pinMode(VOLTAGE_PIN, INPUT);

   uint32_t vRef = VREF; // default VREF for voltage measurement
  //uint32_t raw = analogRead(VOLTAGE_PIN);

   // Prüft, ob und welche eFuse-Daten Kalibrationsdaten vorhanden sind
  esp_adc_cal_value_t efuse_config = esp_adc_cal_characterize(
      ADC_UNIT_1, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, vRef, &adc_chars);
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_TP) 
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_TP : Two-Point Calibration from eFuse");
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_VREF) 
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_VREF: eFuse Vref Used");
  if (efuse_config == ESP_ADC_CAL_VAL_DEFAULT_VREF)
    logOut(2, (char*)"ESP_ADC_CAL_VAL_DEFAULT_VREF: Your Provided Default Vref Is Used");
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_TP_FIT)
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_TP_FIT: Curve fitting based on eFuse data");

  // arduino method of voltage reading 
  millivolts1 = 2 * analogReadMilliVolts(VOLTAGE_PIN); // 1:1 divider, so multiply by two
  voltArduino = (float)millivolts1 / 1000.0;

  // esp method of voltage reading
  raw = analogRead(VOLTAGE_PIN);
  millivolts2 = 2* esp_adc_cal_raw_to_voltage(raw, &adc_chars); // 1:1 divider, so multiply by two
  voltESP = (float)millivolts2 / 1000.0;
  
  sprintf(outstring,"millivolts1: %ld raw: %ld, millivolts2: %ld (default vRef: %ld) efuse_config: %ld",
    millivolts1, raw, millivolts2, vRef, efuse_config);
  logOut(2,outstring);

  // Original, works well on Lolin32
  //raw = analogRead(VOLTAGE_PIN);// / 4096.0 * 7.23;      // LOLIN D32 (no voltage divider need already fitted to board.or NODEMCU ESP32 with 100K+100K voltage divider
  voltDirect= (float)raw / 4096.0 * 7.23;

  //float voltage = analogRead(39) / 4096.0 * 7.23;    // NODEMCU ESP32 with 100K+100K voltage divider added
  //float voltage = analogRead(A0) / 4096.0 * 4.24;    // Wemos / Lolin D1 Mini 100K series resistor added
  //float voltage = analogRead(A0) / 4096.0 * 5.00;    // Ardunio UNO, no voltage divider required

  // select which voltage value to use
  *volt= voltESP;

  // original percent calculation from curve fitting
  percentFit1 = 2808.3808 * pow(*volt, 4) - 43560.9157 * pow(*volt, 3) + 252848.5888 * pow(*volt, 2) - 650767.4615 * *volt + 626532.5703;
  if(percentFit1<0) percentFit1 =0; // to ensure that the above formula does not produce negative values, as it does slightly above 3.5V
  if (*volt > 4.19) percentFit1 = 100;
  else if (*volt <= 3.50) percentFit1 = 0;

  // Berechnung von reddit https://www.reddit.com/r/esp32/comments/1dybanl/measuring_battery_levels/
  // percent calculation from another curve fitting
  double v = *volt;
  percentFit2 = -  144.9390 * v*v*v + 1655.8629 *v*v - 6158.8520 * v + 7501.3202;
  percentFit2 = max((float)0.0, percentFit2);
  percentFit2 = min((float)100.0, percentFit2);

  // get percent value from table, based on measurement. See above.
  percentTable = (float)getChargeLevelFromVolts(*volt);

  sprintf(outstring, "Voltage from GPIO: %d  raw: %d voltESP: %3.2f voltArduino: %3.2f voltDirect: %3.2f percentFit1: %3.1f percentFit2 %3.1f percentTable: %3.1f",
                                VOLTAGE_PIN,     raw,voltESP,       voltArduino,       voltDirect,       percentFit1,       percentFit2,      percentTable);
  logOut(2,outstring);

  // use percent3 from table
  *percent = percentTable;
  sprintf(outstring,"Used Volt: %3.2f Used Percent %3.1f", *volt, *percent);
  logOut(2,outstring);
  return(true);
}


/*************************** getBatteryCapacity ************************** */
/*
int readBatteryVoltageOld(float* percent, float* volt)
{
  uint16_t readval;
  uint32_t millivolts1, millivolts2;

  float volt_arduino, volt_esp, volt_direct;
  float percent_arduino, percent_esp, percent_direct, percent_table;

  esp_adc_cal_characteristics_t adc_chars;

  *percent = 100;
  pinMode(VOLTAGE_PIN, INPUT);

  // Prüft, ob Curve Fitting (TP_FIT) eFuse-Daten vorhanden sind

  //if (esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_TP_FIT) == ESP_OK) {
  //   sprintf(outstring,"eFuse Kalibrierdaten (TP_FIT) vorhanden!");
  //} 
  //else {
  //   sprintf(outstring,"Keine eFuse Kalibrierdaten gefunden. Nutze Default-Werte.\n");
  //}
  //logOut(2,outstring);


  uint32_t vRef = VREF;
  //uint32_t raw = analogRead(VOLTAGE_PIN);

  esp_adc_cal_value_t efuse_config = esp_adc_cal_characterize(
      ADC_UNIT_1, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, vRef, &adc_chars);
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_TP) 
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_TP : Two-Point Calibration from eFuse");
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_VREF) 
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_VREF: eFuse Vref Used");
  if (efuse_config == ESP_ADC_CAL_VAL_DEFAULT_VREF)
    logOut(2, (char*)"ESP_ADC_CAL_VAL_DEFAULT_VREF: Your Provided Default Vref Is Used");
  if (efuse_config == ESP_ADC_CAL_VAL_EFUSE_TP_FIT)
    logOut(2, (char*)"ESP_ADC_CAL_VAL_EFUSE_TP_FIT: Curve fitting based on eFuse data");

  millivolts1 = 2 * analogReadMilliVolts(VOLTAGE_PIN); // 1:1 divider, so multiply by two
  volt_arduino = (float)millivolts2 / 1000.0;

  uint32_t raw = analogRead(VOLTAGE_PIN);
  millivolts2 = 2* esp_adc_cal_raw_to_voltage(raw, &adc_chars); // 1:1 divider, so multiply by two
  volt_esp = (float)millivolts2 / 1000.0;
  
  sprintf(outstring,"millivolts1: %ld raw: %ld, millivolts2: %ld (default vRef: %ld) efuse_config: %ld",
    millivolts1, raw, millivolts2, vRef, efuse_config);
  logOut(2,outstring);

  // Berechnung von reddit https://www.reddit.com/r/esp32/comments/1dybanl/measuring_battery_levels/
  double v = (double)millivolts2 / 1000.0;
  double percent2 = -  144.9390 * v*v*v + 1655.8629 *v*v - 6158.8520 * v + 7501.3202;
  percent2 = max(0.0, percent2);
  percent2 = min(100.0, percent2);

  // Original, works well on Lolin32
  readval = analogRead(VOLTAGE_PIN);// / 4096.0 * 7.23;      // LOLIN D32 (no voltage divider need already fitted to board.or NODEMCU ESP32 with 100K+100K voltage divider
  volt_direct= (float)readval / 4096.0 * 7.23;
  *volt= volt_direct;
  //float voltage = analogRead(39) / 4096.0 * 7.23;    // NODEMCU ESP32 with 100K+100K voltage divider added
  //float voltage = analogRead(A0) / 4096.0 * 4.24;    // Wemos / Lolin D1 Mini 100K series resistor added
  //float voltage = analogRead(A0) / 4096.0 * 5.00;    // Ardunio UNO, no voltage divider required
  
