88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  handleExt0Wakeup()
  @details handle wakeup by EXT0 wakeup source = button via GPIO 
  @return void
*****************************************************************************/
void handleExt0Wakeup()
{
    // if woken up by button remember this, may be alert acknowledge
    wData.buttonPressed = true;

    // if in alert mode
    if(!wData.alertON){
      // do something tbd
    } // !alertON
}

/*****************************************************************************! 
  @brief    print_wakeup_reason
  @details  determine wakeup reason
  @param  void
  @return wakeup reason, or 0 if not just woken up
*****************************************************************************/
// https://randomnerdtutorials.com/esp32-deep-sleep-arduino-ide-wake-up-sources/
uint32_t print_wakeup_reason() 
{
  esp_sleep_wakeup_cause_t wakeup_reason;
  static int calls = 0;

  if(calls++ == 0){
    wakeup_reason = esp_sleep_get_wakeup_cause();

    switch (wakeup_reason) {
      case ESP_SLEEP_WAKEUP_EXT0:     logOut(2,(char*)"Wakeup caused by external signal using RTC_IO"); break;
      case ESP_SLEEP_WAKEUP_EXT1:     logOut(2,(char*)"Wakeup caused by external signal using RTC_CNTL"); break;
      case ESP_SLEEP_WAKEUP_TIMER:    logOut(2,(char*)"Wakeup caused by timer"); break;
      case ESP_SLEEP_WAKEUP_TOUCHPAD: logOut(2,(char*)"Wakeup caused by touchpad"); break;
      case ESP_SLEEP_WAKEUP_ULP:      logOut(2,(char*)"Wakeup caused by ULP program"); break;
      default:                        sprintf(outstring,"Wakeup was not caused by deep sleep: %d\n", wakeup_reason); break;
                                      logOut(2, outstring);
    }
    return(wakeup_reason);
  }
  return(0);
}

/*****************************************************************************! 
  @brief    gotoDeepSleep: routine to enter deep sleep
  @details  wakeup possible by GPIO specified. 
  @param  deepSleepTime  time to to into deep sleep
  @return void
*****************************************************************************/
void gotoDeepSleep(gpio_num_t button, uint64_t deepSleepTime)
{
  //**********  TEST override
  // sleeptime = 60 * SECONDS - 1000*(millis()-startTimeMillis);
  uint32_t am = millis();
  sprintf(outstring,"Hibernating for target %ld sec: %lld usec ", 
          wData.targetMeasurementIntervalSec, deepSleepTime);  
  logOut(2,outstring);
  if(deepSleepTime > maxSleeptimeSafetyLimit){
    sprintf(outstring,"Hibernating time %lld usec above safety limit. Reducing to %ld usec    ", 
          deepSleepTime, maxSleeptimeSafetyLimit);  
    logOut(2,outstring);
  }

  // shut down display
  endDisplay(1); // mode 0: power off, mode 1: hibernate
  //1: display.hibernate();  // danach wird beim wieder aufwachen kein Reset des Screens gemacht.
  //0: display.powerOff(); // danach wird beim wieder aufwachen ein voller Reset des Screens gemacht

  // Initiate sleep
  esp_sleep_enable_timer_wakeup(deepSleepTime);   // define sleeptime for timer wakeup
  // and via external pin. only one seems possible.
  // https://randomnerdtutorials.com/esp32-deep-sleep-arduino-ide-wake-up-sources/
  #ifdef LOLIN32_LITE
    //esp_sleep_enable_ext0_wakeup(button, HIGH); // enable wakeup via button1 HIGH
    esp_sleep_enable_ext0_wakeup(button, LOW); // enable wakeup via button1 LOW
  #endif  
  #ifdef CROW_PANEL
    esp_sleep_enable_ext0_wakeup(button, LOW); // enable wakeup via button1
  #endif  
  //rtc_gpio_pullup_dis(button);  //Configure pullup/downs via RTCIO to LOW during deepsleep
  //rtc_gpio_pulldown_en(button); // EXT0 resides in the same power domain (RTC_PERIPH) as the RTC IO pullup/downs.
  rtc_gpio_pullup_en(button);  //Configure pullup/downs via RTCIO to HIGH during deepsleep
  rtc_gpio_pulldown_dis(button); // EXT0 resides in the same power domain (RTC_PERIPH) as the RTC IO pullup/downs.
    
  esp_deep_sleep_start();                               // go to sleep
}

/*****************************************************************************! 
  @brief  handleParamChange - Main worker routine to handle single parameter changes
  @details This routine handles the adaptation of a single parameter via rotary encode
  @param  int trianglePos : position of triangle indicating which parameter to change. 
  @param  0: anchor bearing; 1: anchor distance, 2: alarm coount; 3:alarm distance
  @return boolean : true if parameter change ongoing, false if exit parameter change mode

*****************************************************************************/
boolean handleParamChange(int trianglePos)
{
  switch(trianglePos){
    case 0: // anchor bearing
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          wData.anchorBearingDeg += encoderPos * 5.0/2; // each step is 5 degrees. But: always double steps
          wData.anchorBearingDeg = (int)wData.anchorBearingDeg  - ((int)wData.anchorBearingDeg % 5); // align to 5er steps
          if(wData.anchorBearingDeg < 0)
            wData.anchorBearingDeg += 360;
          wData.anchorBearingDeg = ((int)wData.anchorBearingDeg) % 360; // wrap around
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Anchor bearing changed to %3.0f degrees (encoder: %ld)", 
            wData.anchorBearingDeg, encoderPos);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break;
    case 1: // anchor distance
      {
        int64_t encoderPos64 = -encoder.getCount();
        if(encoderPos64 != 0){
          float encoderPos = (float)encoderPos64/2.0;
          wData.anchorDistanceM += encoderPos; // each step is 1 meter. But: always double steps
          if(wData.anchorDistanceM < 5)
            wData.anchorDistanceM = 1; // minimum 1 meters
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Anchor distance changed to %3.0f meters (encoder: %f)", 
            wData.anchorDistanceM, encoderPos);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break;
    case 2: // alarm count
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          wData.alarmThreshold += encoderPos* 1/2; // each step is 1 meter. But: always double steps
          if(wData.alarmThreshold < 1)
            wData.alarmThreshold = 1; // minimum 1
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: Alarm count changed to %ld (encoder: %ld)", 
            wData.alarmThreshold, encoderPos);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      } 
      break;
    case 3: // alarm distance
      {
        int64_t encoderPos64 = -encoder.getCount();
        if(encoderPos64 != 0){
          float encoderPos = (float)encoderPos64/2.0;
          wData.alarmDistanceM += encoderPos; // each step is 1 meter. But: always double steps
          if(wData.alarmDistanceM < 1)
            wData.alarmDistanceM = 1; // minimum 1 meter
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Alarm distance changed to %3.0f meters (encoder: %f)", 
            wData.alarmDistanceM, encoderPos);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      } 
      break;   
    case 4: // sleep time
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          wData.targetMeasurementIntervalSec += encoderPos* 1/2; // each step is 1 meter. But: always double steps
          // einfach nur auf +/- dämpft das besser
          //if(encoderPos > 0)
          //  wData.targetMeasurementIntervalSec = wData.targetMeasurementIntervalSec + 1; 
          //else if(encoderPos < 0)
          //  wData.targetMeasurementIntervalSec = wData.targetMeasurementIntervalSec - 1; 
          if(wData.targetMeasurementIntervalSec < 0)
            wData.targetMeasurementIntervalSec = 0; // minimum 0 second
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: targetMeasurementIntervalSec to %ld [s] (encoder: %ld)", 
            wData.targetMeasurementIntervalSec, encoderPos);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 5: // detail verbosity
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          // Drehwert-basierte Abfrage -  nich so gut für ENUM-Werte, springt meist einen zu weit
          //wData.verbosity = (enum verbosityType)(wData.verbosity + (verbosityType)encoderPos); // each step is 1
          //if(wData.verbosity > HI) 
          //  wData.verbosity = LO; // handle runover, valid are 0..2
          //if(wData.verbosity < LO) 
          //  wData.verbosity = HI; // handle runover, valid are 0..2  

          // einfach nur auf +/- dämpft das besser
          if(encoderPos > 0)
            wData.verbosity = (enum verbosityType)(wData.verbosity + 1); 
          else if(encoderPos < 0)
            wData.verbosity = (enum verbosityType)(wData.verbosity - 1); 
          if(wData.verbosity > HI) 
            wData.verbosity = LO; // handle runover, valid are 0..2
          if(wData.verbosity < LO) 
            wData.verbosity = HI; // handle runover, valid are 0..2        

          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: verbosity to %ld [s]", wData.verbosity);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 6: // graph weight  
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          // Drehwert-basierte Abfrage -  nich so gut für ENUM-Werte, springt meist einen zu weit
          //wData.graphWeight = (enum graphWeightType)(wData.graphWeight + (graphWeightType)encoderPos); // each step is 1 
          //if(wData.graphWeight > HEAVY) 
          //  wData.graphWeight = MINIM; // handle runover, valid are 0..2
          //if(wData.graphWeight < MINIM) 
          //  wData.graphWeight = HEAVY; // handle runover, valid are 0..2  

          // einfach nur auf +/- dämpft das besser
          if(encoderPos > 0)
            wData.graphWeight = (enum graphWeightType)(wData.graphWeight + 1); 
          else if(encoderPos < 0)
            wData.graphWeight = (enum graphWeightType)(wData.graphWeight - 1); 
          if(wData.graphWeight > HEAVY) 
            wData.graphWeight = MINIM; // handle runover, valid are 0..2
          if(wData.graphWeight < MINIM) 
            wData.graphWeight = HEAVY; // handle runover, valid are 0..2                


          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: graphWeight to %ld [s]", wData.graphWeight);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 7: // power save mode 
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          // einfach nur auf +/- dämpft das besser
          if(encoderPos > 0)
            wData.PowerSaveMode = (enum powerSaveType)(wData.PowerSaveMode + 1); 
          else if(encoderPos < 0)
            wData.PowerSaveMode = (enum powerSaveType)(wData.PowerSaveMode - 1); 
          if(wData.PowerSaveMode > MAX) 
            wData.PowerSaveMode = MIN; // handle runover, valid are 0..2
          if(wData.PowerSaveMode < MIN) 
            wData.PowerSaveMode = MAX; // handle runover, valid are 0..2                

          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          wData.powerSaveChanged = true;   // flag to indicate that power save mode has changed
          sprintf(outstring,"handleParamChange: PowerSaveMode to %ld [s]", wData.PowerSaveMode);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break;       
    case 8: // exit parameter change mode
      {
        logOut(2, (char*)"handleParamChange: !!!!!!!!! EXIT !!!!!!!!!");
        return false;
      }
      break;   
    default:
      sprintf(outstring,"handleParamChange: default %d in case statement",trianglePos);
      logOut(2, outstring);
  } 
  return true;
}

