88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  doWork - Routine main worker routine
  @details 
  @return void
*****************************************************************************/

// helper function to clear drawing buffer for historic positions
// which remain only valid as long as anchor position, alarm radius etc are not changed
void clearGraphBuffer(int callerID)
{
  sprintf(outstring,"clearing data buffer. Caller: %d", callerID);
  logOut(2,outstring);
  wData.drawCount = 0;    // no. of points in draw buffer
  // wData.startCounter = 0; // no of measurements. not resetted, seems better
  wData.graphBufferClearingNeeded = false;
  for (int i=0; i<maxDrawBufferLen; i++){
    wData.drawBuffer[i][0] = 0;
    wData.drawBuffer[i][1] = 0;
    }
}

// helper function to populate the wData structure
void updatewData() 
{
  wData.actLat = gps.location.lat();
  wData.actLon = gps.location.lng();
  wData.actHDOP= gps.hdop.hdop();
  wData.SatCnt = gps.satellites.value();

  // calculate distance between actual position and anchor position
  wData.actAnchorDistanceM = TinyGPSPlus::distanceBetween(wData.actLat,wData.actLon, wData.anchorLat, wData.anchorLon);
  // calculate bearing from first to second position. Here: from anchor to actual position of boat
  wData.actAnchorBearingDeg = TinyGPSPlus::courseTo(wData.anchorLat, wData.anchorLon, wData.actLat,wData.actLon);

  // first check for distance from anchor
  // calc alert counter, based on deviation
  // 10% over adds 1, 30% over adds 3, 100% over adds 10
  if(wData.actAnchorDistanceM > wData.alarmDistanceM)
     wData.alertCount += 10.0* (wData.actAnchorDistanceM / wData.alarmDistanceM -1.0);
  else
    wData.alertCount = 0.0;

  wData.alertON = false;  // start out with no alert
  strcpy(wData.alertReasonString,"");
  wData.alertReason = 0;

  if(wData.alertCount >= wData.alarmThreshold){       // alarm if alert counter above threshold
    wData.alertON = true;
    wData.alertReason += 1;
    strcat(wData.alertReasonString, "Anchor Distance.  ");
  }  

  if(wData.batteryVoltage < BAT_VOLTAGE_THRESHOLD){   // or alarm if battery voltage too low 
    wData.alertON = true;
    wData.alertReason += 2;
    strcat(wData.alertReasonString, "Bat Voltage Low.  ");
  }  

  if(wData.batteryPercent < BAT_PERCENT_THRESHOLD){ 
    wData.alertReason += 4;
    wData.alertON = true;
    strcat(wData.alertReasonString,  "Bat Percent Low.  ");
  }

  if(!gps.location.isValid()){                        // or alarm if no GPS reception   
    boolean ret = gpsReEstablished(wData.noGpsAlertThreshold);
    if(!ret){
      wData.validGPSLocation = false;  
      wData.alertON = true;
      wData.alertReason += 8;
      strcat(wData.alertReasonString,"Invalid GPS Loc.  ");
    }
    /*
    wData.noGpsCount++;
    if(wData.noGpsCount > wData.noGpsAlertThreshold){
      wData.validGPSLocation = false;  
      wData.alertON = true;
      wData.alertReason += 8;
      strcpy(wData.alertReasonString, "Invalid GPS Loc.  ");
    }
    */  
  } 
  else
    wData.noGpsCount = 0;   
}

// main routine work function
void doRoutineWork()
{
  int cnt = 0;
  uint32_t ret;
  boolean gpsValid = false, gpsUpdated = false;
  static int trianglePos = 0; // position of triangle indicator, serves as line selector
  static boolean handleParamchanges = false; // if true, handle parameter changes per line
  uint32_t targetSleepUSec;               // target sleep time in microseconds
  static uint32_t menuStartTimer = 0;     // millis to remember time when menu has been started

  // determine reason for wakeup. if timer wakeup: continue with measurements. 
  // if EXT0 wakeup (button pressed): handleExt0Wakeup()
  // Moved to setup() 04.03.26
  //ret = print_wakeup_reason(); // determine reason for wakeup
  //if(ret == ESP_SLEEP_WAKEUP_EXT0)
  //  handleExt0Wakeup();

  readBatteryVoltage(&wData.batteryPercent, &wData.batteryVoltage);                  // Auslesen der Batteriespannung  

  sprintf(outstring,"doRoutineWork in wData.currentMode:  %d", wData.currentMode);
  logOut(2, outstring);
  delay(100);

  switch(wData.currentMode){
    case MODE_STARTED:    // 0 just switched on
      { 
        // includes clear screen & setting of font/rotation. 
        // Otherwise following messages will show small and rotated within previous screen
        //sprintf(outstring,"AnchorAlarm %s", VERSION);
        //showWelcomeMessage(true, outstring,1);
        
        sprintf(outstring,"Wait for GPS Fix");
        showWelcomeMessage(true, outstring,1);
        do{
          sprintf(outstring,"doRoutineWork: MODE_STARTED, waiting for GPS fix... %d", cnt);
          logOut(2, outstring);
          gpsValid = gpsTest();
        } 
        while(!gpsValid && cnt++<120); // wait up to 120 seconds for gps fix

        if(gpsValid){
          sprintf(outstring,"Valid GPS Fix");
          showWelcomeMessage(false, outstring,1);
        }
        else{
          sprintf(outstring,"NO GPS Fix");
          showWelcomeMessage(false, outstring,1);
        }  
        //smartDelay(1000);
        setScreenParameters();
        drawInputMainScreen();
        drawInputHeader();
        drawInputData();
        if(gpsValid){
          wData.currentMode = MODE_SELECTLINE; // to to input mode if gps is valid
          menuStartTimer = millis();            // remember timer when gone to change parameter mode
        }  
      }
      break;
    case MODE_SELECTLINE:    // 1 input mode to set position of triangle
      {
        int64_t encoderPos;
        sprintf(outstring,"doRoutineWork: MODE_SELECTLINE ... %d", cnt);
        logOut(2, outstring);
        //gpsValid = gpsTest();
        gpsValid=gps.location.isValid();
        gpsUpdated=gps.location.isUpdated();
        if(gpsValid && gpsUpdated){
          wData.actLat = gps.location.lat();
          wData.actLon = gps.location.lng();
          if(!wData.buttonPressed) // quicker if button pressed
            drawInputHeader();
        }
        
        if(!wData.buttonPressed){ // quicker if button pressed
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle pointing to input data box
          //delay(200); // wait 0,2 seconds
          drawTriangle(false,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle pointing to input data box
        
          encoderPos = encoder.getCount();
          if(encoderPos != 0){
            if(encoderPos > 0)
              trianglePos --; // decrease
            else if(encoderPos < 0)
              trianglePos ++; // increase
            if(trianglePos < 0) // wrap around
              trianglePos = NUM_INPUTDATA_LINES-1;  // max of 9 positions 0..8
            trianglePos = (trianglePos) % NUM_INPUTDATA_LINES; // 8 positions
            sprintf(outstring,"doRoutineWork: Encoder triggered. encoderPos: %ld New trianglePos: %d", (int32_t)encoderPos, trianglePos);
            logOut(2, outstring);
            encoder.setCount(0); // reset encoder count
          }  // encoder
        } // button

